In [1]:
import numpy as np
import pandas as pd
import os

In [2]:
os.getcwd()

'C:\\Users\\91965\\Desktop'

In [3]:
os.chdir("C:/Users\91965\Desktop\PANDAS READ DATA\PANDAS READ FILE WITH  DATA")

In [4]:
os.listdir()[3]

'csv_mindex.csv'

In [5]:
a=pd.read_json("employee_data.json")

In [10]:
a

                                              features
0    {'candidate': {'first_name': 'Margaret', 'last...
1    {'candidate': {'first_name': 'Michael', 'last_...
2    {'candidate': {'first_name': 'Brenda', 'last_n...
3    {'candidate': {'first_name': 'Joseph', 'last_n...
4    {'candidate': {'first_name': 'Laura', 'last_na...
..                                                 ...
495  {'candidate': {'first_name': 'Robert', 'last_n...
496  {'candidate': {'first_name': 'Lucas', 'last_na...
497  {'candidate': {'first_name': 'Kimberly', 'last...
498  {'candidate': {'first_name': 'Karla', 'last_na...
499  {'candidate': {'first_name': 'Mrs.', 'last_nam...

[500 rows x 1 columns]

In [6]:
c=pd.DataFrame([(i["candidate"])for i in a["features"]])

In [7]:
c

,first_name,last_name,skills,state,specialty,experience,relocation
0,Margaret,Mcdonald,"[skLearn, Java, R, SQL, Spark, C++]",AL,Database,Mid,no
1,Michael,Carter,"[TensorFlow, R, Spark, MongoDB, C++, SQL]",AR,Statistics,Senior,yes
2,Brenda,Tyler,[Spark],UT,Database,Mid,no
3,Joseph,King,"[skLearn, SQL, R, Spark, Java, C++, Python, Te...",FL,Machine Learning,Senior,maybe
4,Laura,Webb,"[TensorFlow, C++, SQL, Java, R, MongoDB]",WY,Machine Learning,Junior,maybe
...,...,...,...,...,...,...,...
495,Robert,Baker,"[skLearn, Spark, C++, Java]",WA,Machine Learning,Mid,yes
496,Lucas,Brock,[C++],AR,Machine Learning,Junior,no
497,Kimberly,Richardson,"[Python, Java]",IA,Machine Learning,Junior,maybe
498,Karla,Salazar,"[MongoDB, Python, Java, skLearn]",NE,Data Visualization,Senior,yes
499,Mrs.,Debra,"[skLearn, R, MongoDB, Spark, TensorFlow, Java,...",TX,Statistics,Senior,no

In [50]:
c.shape

(500, 7)

In [30]:
"R" in c["skills"][0]

True

In [45]:
x=[]
for i in range (len(c["skills"])):
    if "R" in c["skills"][i] and "SQL" in c["skills"][i]:
        for j in c["first_name"]:
            x.append(j)

In [46]:
x

['Margaret',
 'Michael',
 'Brenda',
 'Joseph',
 'Laura',
 'Cheryl',
 'Charles',
 'Bradley',
 'William',
 'Richard',
 'Robert',
 'Tanya',
 'Scott',
 'Brett',
 'Sean',
 'Steven',
 'Mr.',
 'Linda',
 'Jacob',
 'Nicole',
 'James',
 'Whitney',
 'Rachel',
 'Mitchell',
 'Michael',
 'Cory',
 'Mary',
 'Mary',
 'Norma',
 'Briana',
 'Ashley',
 'William',
 'Donna',
 'Tiffany',
 'Luis',
 'Travis',
 'Robin',
 'Christine',
 'April',
 'Jeffrey',
 'Michael',
 'Jack',
 'Amber',
 'Sarah',
 'Carrie',
 'Elizabeth',
 'Aaron',
 'Richard',
 'Ann',
 'Barbara',
 'Neil',
 'Sarah',
 'Tiffany',
 'Shawn',
 'Brett',
 'Alexandra',
 'Nathan',
 'Jennifer',
 'Paul',
 'James',
 'Kimberly',
 'Paul',
 'Andrea',
 'Samantha',
 'Gregg',
 'James',
 'Tammy',
 'Tiffany',
 'Steven',
 'Matthew',
 'Dennis',
 'Jennifer',
 'Douglas',
 'Dawn',
 'Ashley',
 'Karen',
 'Michael',
 'Karen',
 'Laura',
 'Mary',
 'Jennifer',
 'Jack',
 'Tammy',
 'Kayla',
 'Roy',
 'Rebecca',
 'Stephanie',
 'Mark',
 'Sharon',
 'Karen',
 'Michael',
 'David',
 'Nicholas',
 'Suzanne',
 'Shawna',
 'Brittany',
 'Roy',
 'Melissa',
 'George',
 'Krista',
 'Zachary',
 'Valerie',
 'Theresa',
 'Gloria',
 'Denise',
 'Deborah',
 'Kevin',
 'Jeffrey',
 'Emily',
 'Jacqueline',
 'Sarah',
 'Rodney',
 'Jennifer',
 'Michael',
 'Shirley',
 'Larry',
 'Jacob',
 'Keith',
 'Christina',
 'Danielle',
 'Erin',
 'Jonathan',
 'Thomas',
 'Christina',
 'Wendy',
 'Nicholas',
 'Ariel',
 'Donald',
 'Nathan',
 'Ian',
 'James',
 'Olivia',
 'Victoria',
 'Kevin',
 'Kevin',
 'Whitney',
 'Norma',
 'Jose',
 'Daisy',
 'Richard',
 'Jennifer',
 'Michael',
 'Bradley',
 'Tyler',
 'Samantha',
 'Sandra',
 'Christine',
 'Shawn',
 'Zachary',
 'Elizabeth',
 'Nicholas',
 'Leonard',
 'Deborah',
 'Curtis',
 'Christopher',
 'James',
 'Vicki',
 'Lori',
 'Benjamin',
 'Julie',
 'Eugene',
 'Lisa',
 'Gregory',
 'Tommy',
 'Jacqueline',
 'Robert',
 'Tamara',
 'Charles',
 'Patrick',
 'James',
 'John',
 'Jessica',
 'Maria',
 'Daniel',
 'Patrick',
 'John',
 'Michael',
 'David',
 'Matthew',
 'Cindy',
 'Connor',
 'Teresa',
 'Ashley',
 'Benjamin',
 'Debra',
 'Amber',
 'Deanna',
 'Lucas',
 'Emily',
 'Jill',
 'Olivia',
 'Stephanie',
 'William',
 'Christy',
 'Carolyn',
 'Joshua',
 'Tracy',
 'Kristy',
 'Victoria',
 'Dale',
 'Chris',
 'Tina',
 'Kelly',
 'Elizabeth',
 'Corey',
 'Rachel',
 'Jennifer',
 'Scott',
 'Matthew',
 'Anthony',
 'Michael',
 'Andrew',
 'Mary',
 'Catherine',
 'James',
 'Carl',
 'Veronica',
 'Ian',
 'Michael',
 'April',
 'Breanna',
 'Christine',
 'Samuel',
 'Cassandra',
 'Emily',
 'Dominic',
 'Anthony',
 'Jennifer',
 'Samantha',
 'Lisa',
 'Stephanie',
 'Yolanda',
 'Peter',
 'Elizabeth',
 'Sharon',
 'Cody',
 'Melissa',
 'Rebecca',
 'Mr.',
 'Jillian',
 'Rachel',
 'Joseph',
 'Haley',
 'Mary',
 'Jennifer',
 'Hayley',
 'Ruth',
 'Carla',
 'Brenda',
 'Amy',
 'Frank',
 'Dr.',
 'John',
 'David',
 'Misty',
 'Susan',
 'Julie',
 'Maria',
 'Daniel',
 'Michael',
 'Angela',
 'Paula',
 'Jennifer',
 'Keith',
 'Meghan',
 'Jared',
 'Todd',
 'Timothy',
 'Peter',
 'Justin',
 'William',
 'Timothy',
 'Hannah',
 'Alexander',
 'Bruce',
 'Amy',
 'Nicole',
 'Matthew',
 'Robert',
 'Randy',
 'Ashley',
 'Christine',
 'Danielle',
 'Tammy',
 'Jordan',
 'Jenny',
 'Joyce',
 'Bradley',
 'Suzanne',
 'Jody',
 'Joan',
 'Joshua',
 'Jared',
 'Julia',
 'Carolyn',
 'Colin',
 'James',
 'Beverly',
 'John',
 'Joshua',
 'Rebecca',
 'Miranda',
 'Katherine',
 'Elizabeth',
 'Jordan',
 'Travis',
 'Sherry',
 'Mark',
 'Rodney',
 'Miss',
 'Melinda',
 'Michael',
 'Dr.',
 'Ann',
 'Cheryl',
 'Jacob',
 'Mrs.',
 'Lori',
 'Paul',
 'Heather',
 'Samantha',
 'Dylan',
 'Stephen',
 'Alexis',
 'Wesley',
 'Mary',
 'Robert',
 'Andrew',
 'Andrew',
 'Katherine',
 'Joyce',
 'Haley',
 'Justin',
 'Cody',
 'Melinda',
 'Robert',
 'Dominic',
 'Steven',
 'Lauren',
 'Robert',
 'Joann',
 'Gloria',
 'Ashley',
 'Victoria',
 'Nancy',
 'Katelyn',
 'Brett',
 'Laurie',
 'Danielle',
 'Jessica',
 'Paige',
 'Felicia',
 'Glenn',
 'Theresa',
 'Alyssa',
 'Aaron',
 'Thomas',
 'Lindsey',
 'John',
 'Nicole',
 'Michelle',
 'Carlos',
 'Jennifer',
 'Janice',
 'Kelly',
 'Paul',
 'Amanda',
 'Adrian',
 'Craig',
 'James',
 'Tracy',
 'Scott',
 'Jon',
 'Rhonda',
 'Paul',
 'Robert',
 'Mark',
 'Larry',
 'Catherine',
 'Kelly',
 'Madison',
 'Patrick',
 'Bryan',
 'Carrie',
 'Kenneth',
 'Thomas',
 'Lisa',
 'Keith',
 'Kimberly',
 'William',
 'Elizabeth',
 'Mary',
 'Donna',
 'Jacob',
 'Ryan',
 'Michael',
 'Jill',
 'Sarah',
 'Thomas',
 'Samantha',
 'Wesley',
 'Christopher',
 'Sandra',
 'Kristin',
 'Heather',
 'Sara',
 'Brittany',
 'Tracey',
 'Brian',
 'Jessica',
 'Joseph',
 'Beth',
 'Teresa',
 'Nicole',
 'Michael',
 'Tyler',
 'Zachary',
 'Joel',
 'Brian',
 'Kathryn',
 'Lindsey',
 'Alejandro',
 'Janet',
 'Gina',
 'Brandy',
 'Rebecca',
 'Stephen',
 'Scott',
 'Danielle',
 'Carl',
 'Jodi',
 'Evelyn',
 'Erika',
 'Steven',
 'Dean',
 'Mitchell',
 'Jennifer',
 'Stephen',
 'Julian',
 'Lisa',
 'Adam',
 'Daniel',
 'John',
 'Travis',
 'Meghan',
 'Cindy',
 'Michael',
 'Tom',
 'Teresa',
 'Sandra',
 'Jason',
 'David',
 'Paul',
 'Nicole',
 'Austin',
 'Emily',
 'Alyssa',
 'Megan',
 'Jennifer',
 'David',
 'Jennifer',
 'Michelle',
 'Cassidy',
 'David',
 'Deanna',
 'Jessica',
 'Rachel',
 'David',
 'Michael',
 'Steven',
 'John',
 'James',
 'William',
 'Haley',
 'Adam',
 'Jeremiah',
 'Valerie',
 'Sophia',
 'Sarah',
 'Laura',
 'Sara',
 'Elizabeth',
 'David',
 'Charlene',
 'Edward',
 'Jaclyn',
 'Karen',
 'David',
 'Philip',
 'Eric',
 'Jill',
 'Mark',
 'Jennifer',
 'Ms.',
 'Brandon',
 'Robert',
 'Lucas',
 'Kimberly',
 'Karla',
 'Mrs.',
 'Margaret',
 'Michael',
 'Brenda',
 'Joseph',
 'Laura',
 'Cheryl',
 'Charles',
 'Bradley',
 'William',
 'Richard',
 'Robert',
 'Tanya',
 'Scott',
 'Brett',
 'Sean',
 'Steven',
 'Mr.',
 'Linda',
 'Jacob',
 'Nicole',
 'James',
 'Whitney',
 'Rachel',
 'Mitchell',
 'Michael',
 'Cory',
 'Mary',
 'Mary',
 'Norma',
 'Briana',
 'Ashley',
 'William',
 'Donna',
 'Tiffany',
 'Luis',
 'Travis',
 'Robin',
 'Christine',
 'April',
 'Jeffrey',
 'Michael',
 'Jack',
 'Amber',
 'Sarah',
 'Carrie',
 'Elizabeth',
 'Aaron',
 'Richard',
 'Ann',
 'Barbara',
 'Neil',
 'Sarah',
 'Tiffany',
 'Shawn',
 'Brett',
 'Alexandra',
 'Nathan',
 'Jennifer',
 'Paul',
 'James',
 'Kimberly',
 'Paul',
 'Andrea',
 'Samantha',
 'Gregg',
 'James',
 'Tammy',
 'Tiffany',
 'Steven',
 'Matthew',
 'Dennis',
 'Jennifer',
 'Douglas',
 'Dawn',
 'Ashley',
 'Karen',
 'Michael',
 'Karen',
 'Laura',
 'Mary',
 'Jennifer',
 'Jack',
 'Tammy',
 'Kayla',
 'Roy',
 'Rebecca',
 'Stephanie',
 'Mark',
 'Sharon',
 'Karen',
 'Michael',
 'David',
 'Nicholas',
 'Suzanne',
 'Shawna',
 'Brittany',
 'Roy',
 'Melissa',
 'George',
 'Krista',
 'Zachary',
 'Valerie',
 'Theresa',
 'Gloria',
 'Denise',
 'Deborah',
 'Kevin',
 'Jeffrey',
 'Emily',
 'Jacqueline',
 'Sarah',
 'Rodney',
 'Jennifer',
 'Michael',
 'Shirley',
 'Larry',
 'Jacob',
 'Keith',
 'Christina',
 'Danielle',
 'Erin',
 'Jonathan',
 'Thomas',
 'Christina',
 'Wendy',
 'Nicholas',
 'Ariel',
 'Donald',
 'Nathan',
 'Ian',
 'James',
 'Olivia',
 'Victoria',
 'Kevin',
 'Kevin',
 'Whitney',
 'Norma',
 'Jose',
 'Daisy',
 'Richard',
 'Jennifer',
 'Michael',
 'Bradley',
 'Tyler',
 'Samantha',
 'Sandra',
 'Christine',
 'Shawn',
 'Zachary',
 'Elizabeth',
 'Nicholas',
 'Leonard',
 'Deborah',
 'Curtis',
 'Christopher',
 'James',
 'Vicki',
 'Lori',
 'Benjamin',
 'Julie',
 'Eugene',
 'Lisa',
 'Gregory',
 'Tommy',
 'Jacqueline',
 'Robert',
 'Tamara',
 'Charles',
 'Patrick',
 'James',
 'John',
 'Jessica',
 'Maria',
 'Daniel',
 'Patrick',
 'John',
 'Michael',
 'David',
 'Matthew',
 'Cindy',
 'Connor',
 'Teresa',
 'Ashley',
 'Benjamin',
 'Debra',
 'Amber',
 'Deanna',
 'Lucas',
 'Emily',
 'Jill',
 'Olivia',
 'Stephanie',
 'William',
 'Christy',
 'Carolyn',
 'Joshua',
 'Tracy',
 'Kristy',
 'Victoria',
 'Dale',
 'Chris',
 'Tina',
 'Kelly',
 'Elizabeth',
 'Corey',
 'Rachel',
 'Jennifer',
 'Scott',
 'Matthew',
 'Anthony',
 'Michael',
 'Andrew',
 'Mary',
 'Catherine',
 'James',
 'Carl',
 'Veronica',
 'Ian',
 'Michael',
 'April',
 'Breanna',
 'Christine',
 'Samuel',
 'Cassandra',
 'Emily',
 'Dominic',
 'Anthony',
 'Jennifer',
 'Samantha',
 'Lisa',
 'Stephanie',
 'Yolanda',
 'Peter',
 'Elizabeth',
 'Sharon',
 'Cody',
 'Melissa',
 'Rebecca',
 'Mr.',
 'Jillian',
 'Rachel',
 'Joseph',
 'Haley',
 'Mary',
 'Jennifer',
 'Hayley',
 'Ruth',
 'Carla',
 'Brenda',
 'Amy',
 'Frank',
 'Dr.',
 'John',
 'David',
 'Misty',
 'Susan',
 'Julie',
 'Maria',
 'Daniel',
 'Michael',
 'Angela',
 'Paula',
 'Jennifer',
 'Keith',
 'Meghan',
 'Jared',
 'Todd',
 'Timothy',
 'Peter',
 'Justin',
 'William',
 'Timothy',
 'Hannah',
 'Alexander',
 'Bruce',
 'Amy',
 'Nicole',
 'Matthew',
 'Robert',
 'Randy',
 'Ashley',
 'Christine',
 'Danielle',
 'Tammy',
 'Jordan',
 'Jenny',
 'Joyce',
 'Bradley',
 'Suzanne',
 'Jody',
 'Joan',
 'Joshua',
 'Jared',
 'Julia',
 'Carolyn',
 'Colin',
 'James',
 'Beverly',
 'John',
 'Joshua',
 'Rebecca',
 'Miranda',
 'Katherine',
 'Elizabeth',
 'Jordan',
 'Travis',
 'Sherry',
 'Mark',
 'Rodney',
 'Miss',
 'Melinda',
 'Michael',
 'Dr.',
 'Ann',
 'Cheryl',
 'Jacob',
 'Mrs.',
 'Lori',
 'Paul',
 'Heather',
 'Samantha',
 'Dylan',
 'Stephen',
 'Alexis',
 'Wesley',
 'Mary',
 'Robert',
 'Andrew',
 'Andrew',
 'Katherine',
 'Joyce',
 'Haley',
 'Justin',
 'Cody',
 'Melinda',
 'Robert',
 'Dominic',
 'Steven',
 'Lauren',
 'Robert',
 'Joann',
 'Gloria',
 'Ashley',
 'Victoria',
 'Nancy',
 'Katelyn',
 'Brett',
 'Laurie',
 'Danielle',
 'Jessica',
 'Paige',
 'Felicia',
 'Glenn',
 'Theresa',
 'Alyssa',
 'Aaron',
 'Thomas',
 'Lindsey',
 'John',
 'Nicole',
 'Michelle',
 'Carlos',
 'Jennifer',
 'Janice',
 'Kelly',
 'Paul',
 'Amanda',
 'Adrian',
 'Craig',
 'James',
 'Tracy',
 'Scott',
 'Jon',
 'Rhonda',
 'Paul',
 'Robert',
 'Mark',
 'Larry',
 'Catherine',
 'Kelly',
 'Madison',
 'Patrick',
 'Bryan',
 'Carrie',
 'Kenneth',
 'Thomas',
 'Lisa',
 'Keith',
 'Kimberly',
 'William',
 'Elizabeth',
 'Mary',
 'Donna',
 'Jacob',
 'Ryan',
 'Michael',
 'Jill',
 'Sarah',
 'Thomas',
 'Samantha',
 'Wesley',
 'Christopher',
 'Sandra',
 'Kristin',
 'Heather',
 'Sara',
 'Brittany',
 'Tracey',
 'Brian',
 'Jessica',
 'Joseph',
 'Beth',
 'Teresa',
 'Nicole',
 'Michael',
 'Tyler',
 'Zachary',
 'Joel',
 'Brian',
 'Kathryn',
 'Lindsey',
 'Alejandro',
 'Janet',
 'Gina',
 'Brandy',
 'Rebecca',
 'Stephen',
 'Scott',
 'Danielle',
 'Carl',
 'Jodi',
 'Evelyn',
 'Erika',
 'Steven',
 'Dean',
 'Mitchell',
 'Jennifer',
 'Stephen',
 'Julian',
 'Lisa',
 'Adam',
 'Daniel',
 'John',
 'Travis',
 'Meghan',
 'Cindy',
 'Michael',
 'Tom',
 'Teresa',
 'Sandra',
 'Jason',
 'David',
 'Paul',
 'Nicole',
 'Austin',
 'Emily',
 'Alyssa',
 'Megan',
 'Jennifer',
 'David',
 'Jennifer',
 'Michelle',
 'Cassidy',
 'David',
 'Deanna',
 'Jessica',
 'Rachel',
 'David',
 'Michael',
 'Steven',
 'John',
 'James',
 'William',
 'Haley',
 'Adam',
 'Jeremiah',
 'Valerie',
 'Sophia',
 'Sarah',
 'Laura',
 'Sara',
 'Elizabeth',
 'David',
 'Charlene',
 'Edward',
 'Jaclyn',
 'Karen',
 'David',
 'Philip',
 'Eric',
 'Jill',
 'Mark',
 'Jennifer',
 'Ms.',
 'Brandon',
 'Robert',
 'Lucas',
 'Kimberly',
 'Karla',
 'Mrs.',
 ...]

In [32]:
c["first_name"][0]

'Margaret'

0      False
1      False
2      False
3      False
4      False
       ...
495    False
496    False
497    False
498    False
499    False
Name: skills, Length: 500, dtype: bool

In [8]:
headers=list(pd.DataFrame(a["features"][0]["candidate"]).columns.values)

In [9]:
headers

['first_name',
 'last_name',
 'skills',
 'state',
 'specialty',
 'experience',
 'relocation']

In [10]:
header1=pd.DataFrame(columns=headers)

In [11]:
header1

Empty DataFrame
Columns: [first_name, last_name, skills, state, specialty, experience, relocation]
Index: []

In [12]:

for i in range (len(a)):
    b=pd.DataFrame(a["features"][i]["candidate"])
    header1= pd.concat([header1,b], ignore_index=True)

In [13]:
i=0

for i in a["features"]:
    b=pd.DataFrame(i["candidate"])
    header1= pd.concat([header1,b], ignore_index=True)

In [14]:

header1

     first_name last_name      skills state   specialty experience relocation
0      Margaret  Mcdonald     skLearn    AL    Database        Mid         no
1      Margaret  Mcdonald        Java    AL    Database        Mid         no
2      Margaret  Mcdonald           R    AL    Database        Mid         no
3      Margaret  Mcdonald         SQL    AL    Database        Mid         no
4      Margaret  Mcdonald       Spark    AL    Database        Mid         no
...         ...       ...         ...   ...         ...        ...        ...
4931       Mrs.     Debra  TensorFlow    TX  Statistics     Senior         no
4932       Mrs.     Debra        Java    TX  Statistics     Senior         no
4933       Mrs.     Debra         SQL    TX  Statistics     Senior         no
4934       Mrs.     Debra      Python    TX  Statistics     Senior         no
4935       Mrs.     Debra         C++    TX  Statistics     Senior         no

[4936 rows x 7 columns]

In [15]:
header1[(header1.skills=="R") & (header1.specialty=="Database")]

     first_name last_name skills state specialty experience relocation
2      Margaret  Mcdonald      R    AL  Database        Mid         no
142       Norma    Norris      R    HI  Database     Junior        yes
158       Donna      Cole      R    CO  Database     Junior      maybe
260     Tiffany    Ramsey      R    SC  Database     Senior      maybe
294        Paul    Miller      R    LA  Database        Mid         no
...         ...       ...    ...   ...       ...        ...        ...
4778     Steven   Nichols      R    WV  Database        Mid      maybe
4781       John    Walker      R    MN  Database     Senior        yes
4787      James    Steele      R    MN  Database     Junior        yes
4886       Jill    Harmon      R    NH  Database        Mid         no
4905   Jennifer    Harris      R    AL  Database     Senior        yes

[126 rows x 7 columns]

In [16]:
header1[(header1.skills.isin(['R','SQL','Java'])) & (header1.specialty == 'Statistics') & (header1.state == 'AR')]

     first_name last_name skills state   specialty experience relocation
7       Michael    Carter      R    AR  Statistics     Senior        yes
11      Michael    Carter    SQL    AR  Statistics     Senior        yes
103       James    Mosley      R    AR  Statistics     Junior        yes
104       James    Mosley   Java    AR  Statistics     Junior        yes
1957     Sandra   Blevins      R    AR  Statistics        Mid      maybe
2475    Michael    Carter      R    AR  Statistics     Senior        yes
2479    Michael    Carter    SQL    AR  Statistics     Senior        yes
2571      James    Mosley      R    AR  Statistics     Junior        yes
2572      James    Mosley   Java    AR  Statistics     Junior        yes
4425     Sandra   Blevins      R    AR  Statistics        Mid      maybe

In [17]:
header1[(header1.skills.isin(["SQL","C++","Python"])) & (header1.specialty.isin(["Data Visualization", "Statistics"]))]

,first_name,last_name,skills,state,specialty,experience,relocation
10,Michael,Carter,C++,AR,Statistics,Senior,yes
11,Michael,Carter,SQL,AR,Statistics,Senior,yes
27,Cheryl,Ramirez,C++,OK,Data Visualization,Mid,no
28,Cheryl,Ramirez,Python,OK,Data Visualization,Mid,no
32,Cheryl,Ramirez,SQL,OK,Data Visualization,Mid,no
...,...,...,...,...,...,...,...
4910,Ms.,Tracy,Python,NM,Data Visualization,Mid,maybe
4924,Karla,Salazar,Python,NE,Data Visualization,Senior,yes
4933,Mrs.,Debra,SQL,TX,Statistics,Senior,no
4934,Mrs.,Debra,Python,TX,Statistics,Senior,no
4935,Mrs.,Debra,C++,TX,Statistics,Senior,no

In [18]:
header1[(header1.skills=="C++")&(header1.skills=="Python")&(header1.specialty=="Machine learning")]

Empty DataFrame
Columns: [first_name, last_name, skills, state, specialty, experience, relocation]
Index: []

In [19]:
header1[(header1.skills.isin(["C++", "Python"]))&(header1.specialty=="Machine Learning")]

,first_name,last_name,skills,state,specialty,experience,relocation
18,Joseph,King,C++,FL,Machine Learning,Senior,maybe
19,Joseph,King,Python,FL,Machine Learning,Senior,maybe
22,Laura,Webb,C++,WY,Machine Learning,Junior,maybe
37,Charles,Stewart,C++,NM,Machine Learning,Mid,maybe
41,Charles,Stewart,Python,NM,Machine Learning,Mid,maybe
...,...,...,...,...,...,...,...
4897,Mark,Mcknight,C++,AK,Machine Learning,Senior,yes
4914,Brandon,Moore,C++,MO,Machine Learning,Mid,no
4918,Robert,Baker,C++,WA,Machine Learning,Mid,yes
4920,Lucas,Brock,C++,AR,Machine Learning,Junior,no
4921,Kimberly,Richardson,Python,IA,Machine Learning,Junior,maybe

In [51]:
candidatelist=pd.DataFrame(columns=headers)
lst=[]

for i in range(len(c["skills"])):
    if "R" in c["skills"][i] and "SQL" in c["skills"][i]:
        lst.append(a["features"][i]["candidate"])

candidatelist=pd.DataFrame(lst)
            
print("Shortlisted candidates are as follow:\n")

candidatelist

Shortlisted candidates are as follow:

,first_name,last_name,skills,state,specialty,experience,relocation
0,Margaret,Mcdonald,"[skLearn, Java, R, SQL, Spark, C++]",AL,Database,Mid,no
1,Michael,Carter,"[TensorFlow, R, Spark, MongoDB, C++, SQL]",AR,Statistics,Senior,yes
2,Joseph,King,"[skLearn, SQL, R, Spark, Java, C++, Python, Te...",FL,Machine Learning,Senior,maybe
3,Laura,Webb,"[TensorFlow, C++, SQL, Java, R, MongoDB]",WY,Machine Learning,Junior,maybe
4,Cheryl,Ramirez,"[C++, Python, R, Java, skLearn, SQL, MongoDB, ...",OK,Data Visualization,Mid,no
...,...,...,...,...,...,...,...
177,Philip,Walters,"[SQL, C++, Spark, Python, R, MongoDB, Java, Te...",NE,Machine Learning,Junior,maybe
178,Jill,Harmon,"[skLearn, Java, R, Python, SQL, Spark, C++]",NH,Database,Mid,no
179,Mark,Mcknight,"[R, Spark, SQL, TensorFlow, Python, MongoDB, C...",AK,Machine Learning,Senior,yes
180,Jennifer,Harris,"[SQL, C++, Java, Spark, Python, R, TensorFlow,...",AL,Database,Senior,yes
181,Mrs.,Debra,"[skLearn, R, MongoDB, Spark, TensorFlow, Java,...",TX,Statistics,Senior,no

In [54]:
candidatelist=pd.DataFrame(columns=headers)
lst=[]

for i in range(len(c["skills"])):
    if "R" in c["skills"][i] and "SQL" in c["skills"][i] and "Statistics" in c["specialty"][i] and "Mid" in c["experience"][i]:
        lst.append(a["features"][i]["candidate"])

candidatelist=pd.DataFrame(lst)
            
print("Shortlisted candidates are as follow:\n")

candidatelist

Shortlisted candidates are as follow:

,first_name,last_name,skills,state,specialty,experience,relocation
0,Tanya,Schultz,"[SQL, MongoDB, R, C++, Spark, TensorFlow]",NV,Statistics,Mid,yes
1,Richard,Estrada,"[Java, TensorFlow, skLearn, R, C++, Python, Sp...",TX,Statistics,Mid,maybe
2,Neil,Maxwell,"[Python, Spark, R, TensorFlow, SQL, Java, C++]",DE,Statistics,Mid,yes
3,Jacqueline,Spencer,"[Java, Python, skLearn, R, MongoDB, C++, SQL, ...",ME,Statistics,Mid,no
4,Christina,Jones,"[R, skLearn, SQL, Java, C++]",IN,Statistics,Mid,yes
5,Norma,Foley,"[MongoDB, SQL, Spark, R, skLearn, Python, Java...",MN,Statistics,Mid,maybe
6,Deborah,Moss,"[Java, SQL, R, C++, skLearn, MongoDB, Python, ...",UT,Statistics,Mid,yes
7,Christopher,Page,"[TensorFlow, Spark, C++, R, SQL]",MS,Statistics,Mid,maybe
8,Daniel,Mcgrath,"[R, Spark, SQL, Java]",WY,Statistics,Mid,maybe
9,Sharon,Allison,"[MongoDB, Python, R, SQL]",WY,Statistics,Mid,maybe
10,Paula,Curtis,"[SQL, Python, TensorFlow, Spark, skLearn, C++,...",ND,Statistics,Mid,no
11,Timothy,Perez,"[skLearn, Python, TensorFlow, R, Spark, MongoD...",IL,Statistics,Mid,maybe
12,Jared,Griffith,"[skLearn, MongoDB, C++, SQL, Java, TensorFlow,...",IN,Statistics,Mid,maybe
13,Beverly,Schneider,"[MongoDB, Python, Spark, R, Java, skLearn, SQL...",MA,Statistics,Mid,maybe
14,Miranda,Mitchell,"[C++, R, Java, Python, SQL, Spark, MongoDB, sk...",WY,Statistics,Mid,maybe
15,Ashley,Chung,"[SQL, Spark, Java, C++, TensorFlow, Python, R,...",NJ,Statistics,Mid,no
16,Janet,Cunningham,"[Java, skLearn, TensorFlow, Python, Spark, Mon...",DE,Statistics,Mid,yes
17,Lisa,Conley,"[R, Python, skLearn, SQL, MongoDB, Spark, Tens...",DE,Statistics,Mid,maybe
18,Cindy,Smith,"[SQL, MongoDB, R, TensorFlow, Java]",NE,Statistics,Mid,yes